Repository: HendrikAlexander/meal_planner_app
Catalog: lib/l10n/app_*.arb
Languages: de

# appTitle
source: Meal Planner App
de: Essensplaner App

source: Username
de: Benutzername

source: Password
de: Passwort

source: Select Role
de: Rolle auswählen

# userRole
source: User
de: Benutzer

# loginButton
source: Login
de: Einloggen

source: Continue as Guest
de: Als Gast fortfahren

source: Change Language
de: Sprache ändern

# linsenCurry
source: Lentil Curry
de: Linsen-Curry

# kaesespaetzle
source: Cheese Spaetzle
de: Käsespätzle

# haehnchenSuessSauer
source: Sweet and Sour Chicken
de: Hähnchen süß-sauer

# gemueseLasagne
source: Vegetable Lasagna
de: Gemüse-Lasagne

# falafelTeller
source: Falafel Plate
de: Falafel-Teller

# wienerSchnitzel
source: Viennese Schnitzel
de: Wiener Schnitzel

# pizzaMargherita
source: Margherita Pizza
de: Pizza Margherita

# tofuPfanne
source: Tofu Stir-fry
de: Tofu-Pfanne

# rindergulasch
source: Beef Goulash
de: Rindergulasch

source: Vegetarian
de: Vegetarisch

source: With Meat
de: Mit Fleisch

# allReviewsTitle
source: All Reviews
de: Alle Bewertungen

source: No reviews available.
de: Keine Bewertungen vorhanden.

# reviewRating
source: Review: {rating} stars
de: Bewertung: {rating} Sterne

source: Food: {name}
de: Essen: {name}

# createdBy
source: Created by: {user}
de: Erstellt von: {user}

# commentText
source: Comment: {comment}
de: Kommentar: {comment}

# editButton
source: Edit
de: Bearbeiten

# deleteButton
source: Delete
de: Löschen

# deleteReviewTitle
source: Delete Review
de: Bewertung löschen

# deleteReviewContent
source: Are you sure you want to delete this review?
de: Möchten Sie diese Bewertung wirklich löschen?

# cancelButton
source: Cancel
de: Abbrechen

# confirmDeleteButton
source: Delete
de: Löschen

source: Monday
de: Montag

source: Tuesday
de: Dienstag

source: Wednesday
de: Mittwoch

source: Thursday
de: Donnerstag

source: Friday
de: Freitag

# essensplanTitle
source: Weekly Plans
de: Wochenpläne

source: Filter by week...
de: Nach Woche filtern...

source: Week
de: Woche

# addReviewTooltip
source: Add review
de: Bewertung abgeben

# addPlanTooltip
source: Add weekly plan
de: Wochenplan hinzufügen

# editPlanButton
source: Edit Plan
de: Plan bearbeiten

# confirmDeleteTitle
source: Confirmation
de: Bestätigung

# confirmDeletePlanContent
source: Are you sure you want to delete the plan for week {weekNumber}?
de: Möchten Sie den Plan für Woche {weekNumber} wirklich löschen?

# speisekarteTitle
source: Menu
de: Speisekarte

# addMealTooltip
source: Add new meal
de: Neues Essen hinzufügen

# confirmDeleteMealContent
source: Are you sure you want to delete "{mealName}"?
de: Möchten Sie "{mealName}" wirklich löschen?

# addMealTitle
source: Add new Meal
de: Neues Essen anlegen

# editMealTitle
source: Edit Meal
de: Essen bearbeiten

# mealNameLabel
source: Name of the meal
de: Name des Gerichts

# priceLabel
source: Price
de: Preis

# saveButton
source: Save
de: Speichern

# addPlanTitle
source: Create New Weekly Plan
de: Neuen Wochenplan erstellen

# editPlanTitle
source: Edit Weekly Plan
de: Wochenplan bearbeiten

# weekNumberLabel
source: Week Number
de: Wochennummer

# selectedMealsLabel
source: Selected Meals ({count}/5) - Adjust order:
de: Ausgewählte Gerichte ({count}/5) - Reihenfolge anpassen:

# availableMealsLabel
source: Available meals to add:
de: Verfügbare Gerichte zum Hinzufügen:

# editMealTooltip
source: Edit meal
de: Gericht bearbeiten

# removeMealFromPlanTooltip
source: Remove meal from plan
de: Gericht aus Plan entfernen

# addMealToPlanTooltip
source: Add meal to plan
de: Gericht zum Plan hinzufügen

# addReviewTitle
source: Add Review
de: Bewertung abgeben

# editReviewTitle
source: Edit Review
de: Bewertung bearbeiten

# loggedInAs
source: Logged in as: {username}
de: Eingeloggt als: {username}

# starsRating
source: {count} Stars
de: {count} Sterne

# yourReviewLabel
source: Your Review
de: Deine Bewertung

source: Take a photo
de: Foto aufnehmen

# photoOnlyOnMobile
source: Taking photos is only available on mobile devices.
de: Fotoaufnahme ist nur auf mobilen Geräten verfügbar.

# cameraNotAvailable
source: Camera not available in simulator. Please test on a real device.
de: Kamera im Simulator nicht verfügbar. Bitte auf einem echten Gerät testen.

# reviewTextRequired
source: Please enter a review text.
de: Bitte geben Sie einen Bewertungstext ein.

# reviewBy
source: Review by: {username}
de: Bewertung von: {username}

# manageMenuTitle
source: Manage Menu
de: Speisekarte verwalten

# manageMenuSubtitle
source: Create, edit, and delete all available meals
de: Alle verfügbaren Essen anlegen, bearbeiten und löschen

# weeklyPlansTitle
source: Weekly Plans
de: Wochenpläne

# weeklyPlansSubtitle
source: View meal plans for the upcoming weeks
de: Essenspläne für die nächsten Wochen anzeigen

# reviewsTitle
source: Reviews
de: Bewertungen

# reviewsSubtitle
source: View all submitted reviews
de: Alle abgegebenen Bewertungen einsehen

# loginSubtitle
source: Log in as an admin or user
de: Anmelden, als Admin oder Nutzer

# loggedInAsInfo
source: Logged in as: {username} ({role})
de: Angemeldet als: {username} ({role})
